ISouthRain/HC32F448-template/.pack/HDSC/HC32F448.1.0.1/SVD/HC32F448FCUI.svd
                <register>
                    <name>DMA_RC_TRGSEL</name>
                    <description>desc DMA_RC_TRGSEL</description>
                    <addressOffset>0x44</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0xC00701FF</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLCHSEL</name>
                            <description>desc PLCHSEL</description>
                            <msb>18</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMEN</name>
                            <description>desc COMEN</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TMR6_TRGSEL0</name>
                    <description>desc TMR6_TRGSEL0</description>
                    <addressOffset>0x48</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0xC00701FF</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLCHSEL</name>
                            <description>desc PLCHSEL</description>
                            <msb>18</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMEN</name>
                            <description>desc COMEN</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TMR6_TRGSEL1</name>
                    <description>desc TMR6_TRGSEL1</description>
                    <addressOffset>0x4C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0xC00701FF</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLCHSEL</name>
                            <description>desc PLCHSEL</description>
                            <msb>18</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMEN</name>
                            <description>desc COMEN</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TMR4_TRGSEL0</name>
                    <description>desc TMR4_TRGSEL0</description>
                    <addressOffset>0x50</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0xC00701FF</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLCHSEL</name>
                            <description>desc PLCHSEL</description>
                            <msb>18</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMEN</name>
                            <description>desc COMEN</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TMR4_TRGSEL1</name>
                    <description>desc TMR4_TRGSEL1</description>
                    <addressOffset>0x54</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0xC00701FF</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLCHSEL</name>
                            <description>desc PLCHSEL</description>
                            <msb>18</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMEN</name>
                            <description>desc COMEN</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TMR4_TRGSEL2</name>
                    <description>desc TMR4_TRGSEL2</description>
                    <addressOffset>0x58</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0xC00701FF</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLCHSEL</name>
                            <description>desc PLCHSEL</description>
                            <msb>18</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMEN</name>
                            <description>desc COMEN</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PEVNT_TRGSEL12</name>
                    <description>desc PEVNT_TRGSEL12</description>
                    <addressOffset>0x5C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0xC00701FF</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLCHSEL</name>
                            <description>desc PLCHSEL</description>
                            <msb>18</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMEN</name>
                            <description>desc COMEN</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PEVNT_TRGSEL34</name>
                    <description>desc PEVNT_TRGSEL34</description>
                    <addressOffset>0x60</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0xC00701FF</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLCHSEL</name>
                            <description>desc PLCHSEL</description>
                            <msb>18</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMEN</name>
                            <description>desc COMEN</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TMR0_TRGSEL</name>
                    <description>desc TMR0_TRGSEL</description>
                    <addressOffset>0x64</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0xC00701FF</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLCHSEL</name>
                            <description>desc PLCHSEL</description>
                            <msb>18</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMEN</name>
                            <description>desc COMEN</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TMRA_TRGSEL0</name>
                    <description>desc TMRA_TRGSEL0</description>
                    <addressOffset>0x68</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0xC00701FF</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLCHSEL</name>
                            <description>desc PLCHSEL</description>
                            <msb>18</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMEN</name>
                            <description>desc COMEN</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TMRA_TRGSEL1</name>
                    <description>desc TMRA_TRGSEL1</description>
                    <addressOffset>0x6C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0xC00701FF</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLCHSEL</name>
                            <description>desc PLCHSEL</description>
                            <msb>18</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMEN</name>
                            <description>desc COMEN</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TMRA_TRGSEL2</name>
                    <description>desc TMRA_TRGSEL2</description>
                    <addressOffset>0x70</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0xC00701FF</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLCHSEL</name>
                            <description>desc PLCHSEL</description>
                            <msb>18</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMEN</name>
                            <description>desc COMEN</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TMRA_TRGSEL3</name>
                    <description>desc TMRA_TRGSEL3</description>
                    <addressOffset>0x74</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0xC00701FF</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLCHSEL</name>
                            <description>desc PLCHSEL</description>
                            <msb>18</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMEN</name>
                            <description>desc COMEN</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC1_TRGSEL0</name>
                    <description>desc ADC1_TRGSEL0</description>
                    <addressOffset>0x78</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0xC00701FF</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLCHSEL</name>
                            <description>desc PLCHSEL</description>
                            <msb>18</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMEN</name>
                            <description>desc COMEN</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC1_TRGSEL1</name>
                    <description>desc ADC1_TRGSEL1</description>
                    <addressOffset>0x7C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0xC00701FF</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLCHSEL</name>
                            <description>desc PLCHSEL</description>
                            <msb>18</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMEN</name>
                            <description>desc COMEN</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC2_TRGSEL0</name>
                    <description>desc ADC2_TRGSEL0</description>
                    <addressOffset>0x80</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1FF</resetValue>
                    <resetMask>0xC00701FF</resetMask>
                    <fields>
                        <field>
                            <name>TRGSEL</name>
                            <description>desc TRGSEL</description>
                            <msb>8</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLCHSEL</name>
                            <description>desc PLCHSEL</description>
                            <msb>18</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMEN</name>
                            <description>desc COMEN</description>
                            <msb>31</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
